export default {
    connect: [
        '连接钱包',
        '复制成功！',
        '未检测到钱包',
        '挖矿'
    ],
    header: [
        '首页',
        '邀请挖矿'
    ],
    intro: [
        '【邀请挖矿说明】',
        '如何通过邀请挖矿获益？',
        '1.邀请好友质押LP Token，您可获得邀请挖矿收益；',
        '2.被邀请人进行质押挖矿，可获得额外挖矿收益；',
        '邀请收益如何计算？',
        'YouSwap创新设定了两级邀请算力机制:',
        '一级邀请算力，收益加成系数为：15%',
        '二级邀请算力，收益加成系数为：10%',
        '与此同时，好友自身也可以获得被邀请奖励，被邀请人收益加成系数为：5%',
        '举例：Alice邀请Bob，Bob邀请Tom',
        '一级邀请算力：Alice可以获得Bob质押挖矿收益的15%',
        '二级邀请算力：Alice可以获得Tom质押挖矿收益的10%',
        '被邀请人收益加成：Bob可以额外获得自身质押挖矿收益的5%'
    ],
    title: [
        '邀请好友，共享收益',
        '和好友一起加入YouSwap，做最富矿主'
    ],
    invite: [
        '邀请挖矿',
        '累积邀请好友',
        '人',
        '一级好友',
        '二级好友',
        '共享算力',
        '激活矿工',
        '获取邀请链接',
        '激活',
        '我的邀请',
        '好友',
        '邀请等级',
        '*已接受',
        '邀请，可享5%额外收益加成。',
        '个人收益邀请加成（YOU）',
        '累积邀请挖矿收益',
        '邀请挖矿收益',
        '连接钱包获取邀请方式',
        '分享海报',
        '复制链接',
        '邀请矿工',
        '暂无邀请',
        '总质押LP收益'
    ],
    level: [
        '一级',
        '二级'
    ],
    activate: [
        '单个矿工激活',
        '批量矿工激活',
        '矿工地址',
        '矿工/好友不存在',
        '好友已被邀请',
        '请先',
        '下载',
        '批量激活格式，按格式上传，点击“激活”按钮进行激活，单次最多可激活',
        '上传激活文件',
        '成功，质押挖矿后可获得5%的额外加成。',
        '共',
        '个矿工被激活成功',
        '上传格式不正确，请上传xls或者xlsx格式',
        '请输入矿工地址',
        '激活成功',
        '激活失败',
        '请求被拒绝',
        '文件中有无效地址',
        '矿工数量',
        '50',
        '个矿工'
    ],
    index: [
        '连接钱包开始激活',
        '地址数量不能超过50',
        '接受邀请成功',
        '接受邀请失败',
        '不能邀请自己',
        '你已邀请该好友',
        '网络错误',
        '文件内容为空',
        '请前往PC端进行批量操作。'
    ],
    notice: [
        '发送链接给好友（被邀请人），好友支付矿工费进行激活，畅享5%额外收益加成。',
        '邀请人支付矿工费，激活好友（被邀请人），获取一级好友15%算力加成，二级好友10%算力加成，好友也可畅享5%额外收益加成。'
    ],
    desc: [
        '邀请好友质押LP Token，您和好友均可获得额外挖矿奖励。',
        '一级邀请奖励系数为：15%;',
        '二级邀请奖励系数为：10%;',
        '同时被邀请人获得奖励系数为：5%;',
        '立即邀请好友，在YouSwap开启挖矿收益之旅，更多邀请，更多收益！',
    ],
    share: [
        '确认',
        '接受',
        '邀请',
        '可享5%额外收益加成。',
        '截图分享'
    ],
    navs: [
        '首页',
        '兑换',
        '流动性',
        '挖矿',
        '行情',
        '邀请挖矿',
        'IDO',
        '跨链桥'
    ],
    liquidity: [
        '通过提供流动性来赚取YOU',
        '邀请挖矿获取更多挖矿算力',
        '仅看自己的挖矿'
    ],
    inviteDig: [
        '累积邀请好友（人）',
        '累积邀请挖矿收益',
        '共享算力邀请',
        '激活矿工邀请',
        '邀请人支付矿工费，激活好友（被邀请人），获取一级好友15%算力加成，二级好友10%算力加成，好友也可畅享5%额外收益加成。',
        '发送链接给好友（被邀请人），好友支付矿工费进行激活，畅享5%额外收益加成。',
        '邀请好友质押LP Token，您和好友均可获得额外挖矿奖励。一级邀请奖励系数为：15%；二级邀请奖励系数为：10%；同时被邀请人获得奖励系数为：5%；立即邀请好友，在YouSwap开启挖矿收益之旅，更多邀请，更多收益！',
        '详情查看',
        '邀请算力所产生奖励包含在挖矿奖励中，矿工点击领取收益即可同步获得邀请算力奖励。'
    ],
    tabs: [
        '进行中',
        '已结束'
    ],
    digcards: [
        'APY',
        '收益币种',
        '算力比例',
        'YOU 收益数量',
        '质押数量',
        '授权',
        '质押',
        '领取',
        '流动性总额',
        '赎回',
        '算力比例=（LP质押算力+邀请算力）/总算力',
        '详情',
        '收起',
        '获取',
        '领取成功',
        '领取失败',
        '赎回并领取成功',
        '赎回并领取失败',
        '授权成功',
        '授权失败',
        '质押成功',
        '质押失败'
    ],
    dialog: [
        '质押LP代币',
        '余额',
        '赎回 LP 代币',
        '取消',
        '确认',
        '赎回并领取',
        '余额不足，请先获取',
        '请输入赎回数量'
    ],
    loading: '数据加载中...',
    nodata: '无矿池',
    isfinshed: '已结束',
    pledgeTotole: '总锁仓量',
    ing:{
        Approving:'授权中...',
        Staking: '质押中...',
        Unstaking: '赎回中...',
        Harvest: '领取中...'
    },
    hopes:'敬请期待',
    startblock: '剩余开始块高'
};